# -*- ii: apisnoop; -*-
#+TITLE: Exploring Pod Proxy
#+AUTHOR: Stephen Heywood
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export

** Deploy REST server

   #+begin_src bash :eval never-export :exports both :session none
     kubectl create -n default deployment --image=heyste/rest-server rest-app
     kubectl get -n default pods -o go-template --template '{{range .items}}{{.metadata.name}}{{"\n"}}{{end}}'
   #+end_src

   #+RESULTS:
   #+begin_example
   deployment.apps/rest-app created
   rest-app-db4b7874d-wldpr
   #+end_example

** REST Method: GET

   #+begin_src bash :eval never-export :exports both :session none
     POD_NAME=$(kubectl get -n default pods -o go-template --template '{{range .items}}{{.metadata.name}}{{"\n"}}{{end}}')
     UA="live-test-writing"
     curl -X GET -s --user-agent $UA http://localhost:8888/api/v1/namespaces/default/pods/$POD_NAME/proxy/all
   #+end_src

   #+RESULTS:
   #+begin_example
   [{"Id":"1","Title":"Hello","desc":"Article Description","content":"Article Content"},{"Id":"2","Title":"Hello 2","desc":"Article Description","content":"Article Content"}]
   #+end_example

** Rest Method: POST

   #+begin_src bash :eval never-export :exports both :session none
     POD_NAME=$(kubectl get -n default pods -o go-template --template '{{range .items}}{{.metadata.name}}{{"\n"}}{{end}}')
     UA="live-test-writing"
     curl -d '{ "Id": "3", "Title": "created", "desc": "desc", "content": "content" }' -s --user-agent $UA http://localhost:8888/api/v1/namespaces/default/pods/$POD_NAME/proxy/article
   #+end_src

   #+RESULTS:
   #+begin_example
   {"Id":"3","Title":"created","desc":"desc","content":"content"}
   #+end_example

** REST Method: DELETE

   #+begin_src bash :eval never-export :exports both :session none
     POD_NAME=$(kubectl get -n default pods -o go-template --template '{{range .items}}{{.metadata.name}}{{"\n"}}{{end}}')
     UA="live-test-writing"
     curl -X DELETE -s --user-agent "live-test-writing" http://localhost:8888/api/v1/namespaces/default/pods/$POD_NAME/proxy/article/3
   #+end_src

   #+RESULTS:
   #+begin_example
   #+end_example

